app/controllers/addresses_controller.rb

  def index
    @addresses = Address.all
---
SELECT `addresses`.* FROM `addresses`

  def show
    @address = Address.find(params[:id])
---
SELECT `addresses`.* FROM `addresses` WHERE (`addresses`.`id` = 1) LIMIT 1

  def edit
    @address = Address.find(params[:id])
---
SELECT `addresses`.* FROM `addresses` WHERE (`addresses`.`id` = 1) LIMIT 1

  def create
    @address = Address.new(params[:address])

    respond_to do |format|
      if @address.save
---
INSERT INTO `addresses` (`created_at`, `custom_type`, `email`, `name`, `phone`, `updated_at`) VALUES ('2011-09-29 11:20:13', 0, 'shijupc@gmail.com', 'test', 1233, '2011-09-29 11:20:13')

  def update
    @address = Address.find(params[:id])

    respond_to do |format|
      if @address.update_attributes(params[:address])
---
SELECT `addresses`.* FROM `addresses` WHERE (`addresses`.`id` = 1) LIMIT 1
UPDATE `addresses` SET `name` = 'test bb', `updated_at` = '2011-09-30 09:04:51' WHERE (`addresses`.`id` = 1)

  def destroy
    @address = Address.find(params[:id])
    @address.destroy
---
SELECT `addresses`.* FROM `addresses` WHERE (`addresses`.`id` = 2) LIMIT 1
DELETE FROM `addresses` WHERE (`addresses`.`id` = 2)

  def search
    @keyword = params[:keyword]
     @addresses = Address.find(:all,:conditions=>"name like '%#{@keyword}%'")
---
SELECT `addresses`.* FROM `addresses` WHERE (name like '%test%')

 def set_address_name
 	@address = Address.find(params[:id])
	@address.name= params[:value]
  	@address.save
---
SELECT `addresses`.* FROM `addresses` WHERE (`addresses`.`id` = 1) LIMIT 1
UPDATE `addresses` SET `name` = 'test bb bb', `updated_at` = '2011-09-30 09:10:04' WHERE (`addresses`.`id` = 1)